research.org
#+title: Research | Ruiyang Wu
#+author: Ruiyang Wu
#+HTML_HEAD_EXTRA: <style type="text/css"> <!--/*--><![CDATA[/*><!--*/ .title { display: none; } /*]]>*/--> </style>

* Research
** Publications
Note: \zwnj^1 represents co-first authors
- Ouyang, W., *Wu, R.*, Hao, N. and Zhang, H. H. (2025)\\
  Dynamic Supervised Principal Component Analysis for
  Classification.\\
  /Journal of Computational and Graphical Statistics/, 34(4),
  1446–1455. [[https://doi.org/10.1080/10618600.2025.2452935][[PDF]​]] [[https://arxiv.org/abs/2411.01820][[arXiv]​]]; R package [[https://github.com/ywwry66/DSPCA][DSPCA]]

- He, Y.^1, *Wu, R.*\zwnj^1, Zhou, Y. and Feng, Y. (2023)\\
  DDAC-SpAM: A Distributed Algorithm for Fitting High-dimensional
  Sparse Additive Models with Feature Division and Decorrelation.\\
  /Journal of the American Statistical Association/, 119(547),
  1933-1944. [[https://doi.org/10.1080/01621459.2023.2225743][[PDF]​]] [[https://arxiv.org/abs/2205.07932][[arXiv]​]]

- *Wu, R.* and Hao, N. (2022)\\
  Quadratic Discriminant Analysis by Projection.\\
  /Journal of Multivariate Analysis/, 190, 104987. [[https://doi.org/10.1016/j.jmva.2022.104987][[PDF]​]] [[https://arxiv.org/abs/2108.09005][[arXiv]​]]; R
  package [[https://github.com/ywwry66/QDA-by-Projection-R-Package][QDAP]]

** Manuscripts
- *Wu, R.* and Hao, N. (2025+)\\
  Dimension Reduction for Quadratic Discriminant Analysis via
  Supervised Principal Component Analysis.\\
  /Manuscript available upon request./ R package [[https://github.com/ywwry66/Dimension-Reduction-for-QDA-via-supervised-PCA][QDAPCA]]

** Conference Presentations
- “Quadratic Discriminant Analysis by Projection”\\
  2022 ICSA China Conference, Virtual/Xi’an, China, July 2022
  (Invited)

- “Quadratic Discriminant Analysis by Projection”\\
  TRIPODS 2nd Southwest Summer Conference, Oracle, AZ, May 2019

- “Quadratic Discriminant Analysis by Projection”\\
  ICSA 2018 Applied Statistics Symposium, New Brunswick, NJ, Jun 2018
