research.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-12-15 Mon 20:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Research | Ruiyang Wu</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Ruiyang Wu" />
<link rel='stylesheet' href='static/worg.css' />
</head>
<body>
<div id="preamble" class="status">
<a href="index.html">Home</a>&nbsp; <a href="teaching.html">Teaching</a>&nbsp; <a href="research.html">Research</a>
</div>
<div id="content">
<h1 class="title">Research | Ruiyang Wu</h1>

<div id="outline-container-org54d0478" class="outline-2">
<h2 id="org54d0478">Research</h2>
<div class="outline-text-2" id="text-org54d0478">
</div>
<div id="outline-container-org346a214" class="outline-3">
<h3 id="org346a214">Publications</h3>
<div class="outline-text-3" id="text-org346a214">
<p>
Note: &zwnj;<sup>1</sup> represents co-first authors
</p>
<ul class="org-ul">
<li>Ouyang, W., <b>Wu, R.</b>, Hao, N. and Zhang, H. H. (2025)<br />
Dynamic Supervised Principal Component Analysis for
Classification.<br />
<i>Journal of Computational and Graphical Statistics</i>, 34(4),
1446–1455. <a href="https://doi.org/10.1080/10618600.2025.2452935">[PDF]​</a> <a href="https://arxiv.org/abs/2411.01820">[arXiv]​</a>; R package <a href="https://github.com/ywwry66/DSPCA">DSPCA</a></li>

<li>He, Y.<sup>1</sup>, <b>Wu, R.</b>&zwnj;<sup>1</sup>, Zhou, Y. and Feng, Y. (2023)<br />
DDAC-SpAM: A Distributed Algorithm for Fitting High-dimensional
Sparse Additive Models with Feature Division and Decorrelation.<br />
<i>Journal of the American Statistical Association</i>, 119(547),
1933-1944. <a href="https://doi.org/10.1080/01621459.2023.2225743">[PDF]​</a> <a href="https://arxiv.org/abs/2205.07932">[arXiv]​</a></li>

<li><b>Wu, R.</b> and Hao, N. (2022)<br />
Quadratic Discriminant Analysis by Projection.<br />
<i>Journal of Multivariate Analysis</i>, 190, 104987. <a href="https://doi.org/10.1016/j.jmva.2022.104987">[PDF]​</a> <a href="https://arxiv.org/abs/2108.09005">[arXiv]​</a>; R
package <a href="https://github.com/ywwry66/QDA-by-Projection-R-Package">QDAP</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga470238" class="outline-3">
<h3 id="orga470238">Manuscripts</h3>
<div class="outline-text-3" id="text-orga470238">
<ul class="org-ul">
<li><b>Wu, R.</b> and Hao, N. (2025+)<br />
Dimension Reduction for Quadratic Discriminant Analysis via
Supervised Principal Component Analysis.<br />
<i>Manuscript available upon request.</i> R package <a href="https://github.com/ywwry66/Dimension-Reduction-for-QDA-via-supervised-PCA">QDAPCA</a></li>
</ul>
</div>
</div>

<div id="outline-container-org19fbb1d" class="outline-3">
<h3 id="org19fbb1d">Conference Presentations</h3>
<div class="outline-text-3" id="text-org19fbb1d">
<ul class="org-ul">
<li>“Quadratic Discriminant Analysis by Projection”<br />
2022 ICSA China Conference, Virtual/Xi’an, China, July 2022
(Invited)</li>

<li>“Quadratic Discriminant Analysis by Projection”<br />
TRIPODS 2nd Southwest Summer Conference, Oracle, AZ, May 2019</li>

<li>“Quadratic Discriminant Analysis by Projection”<br />
ICSA 2018 Applied Statistics Symposium, New Brunswick, NJ, Jun 2018</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<hrstyle="text-align: center;position: fixed;left: 0;bottom: 0;">

<p style="text-align: center;position: fixed;left: 0;bottom: 0;"> Made with org-mode </p>
</div>
</body>
</html>
